Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/gp_and_hospital_services/gps_and_private_patients.html.txt.tmx
Source language: en
Languages: ga

source: GPs and private patients
ga: Liachleachtóirí Ginearálta agus Othair Phríobháideacha

source: If you do not have a medical card or GP Visit Card, you are considered a private patient if you visit your family doctor (GP)
ga: Mura bhfuil cárta leighis agat, ní foláir duit cuairt a thabhairt ar Liachleachtóir ginearálta mar othar príobháideach

source: This means that you must pay for the services provided
ga: Caithfidh tú íoc as na seirbhísí a chuirfear ar fáil duit

source: Some GPs provide services only to private patients
ga: Tá roinnt Liachleachtóirí ginearálta ann nach gcuireann seirbhísí ar fáil ach amháin d'othair phríobháideacha

source: GPs who are in the General Medical Services (GMS) Scheme cannot treat private patients differently from medical card or GP Visit Card holders
ga: Ní féidir leis na Liachleachtóirí ginearálta atá sa scéim Seirbhísí Ginearálta Leighis caitheamh ar bhealach difriúil le othair príobháideacha agus le sealbhóirí chartaí leighis

source: You must be seen in the same premises and have access to the same surgery hours, etc
ga: Ba cheart don dochtúir freastal a dhéanamh ort san áitreabh céanna agus ba cheart duit a bheith in ann teacht ar na huaireanta céanna clinic leis na hothair phríobháideacha

source: There are no set fees or charges for GP services
ga: Níl aon táillí socraithe i gcomhair seirbhísí an Liachleachtóra

source: The relationship between a private patient and a GP is essentially a contract - you enter into a contract with your GP to provide you with services and you pay for the service
ga: Go bunúsach is conradh é an gaol idir othar príobháideach agus liachleachtóir ginearálta - déanann tú conradh le do Liachleachtóir ginearálta le seirbhís a sholáthar duit agus íocann tú as an tseirbhís

source: The amount of the payment is a matter for you and the GP
ga: Is fút féin agus faoin liachleachtóir ginearálta costas na seirbhíse a shocrú eadraibh

source: GPs may provide cetain services to private patients free of charge - for example, maternity and infant welfare services and immunisation and vaccination services if they have agreements with the Health Service Executive (HSE) to do so
ga: Féadfaidh LGanna seirbhísí áirithe a sholáthar saor in aisce – mar shampla, seirbhísí máithreachais agus leas naíonán agus seirbhísí imdhíonachta agus vacsaínithe má bhíonn comhaontuithe acu le Feidhmeannacht na Seirbhíse Sláinte (FSS) chun amhlaidh a dhéanamh

source: In the case of some vaccination services, (for example, the flu vaccine for at-risk groups), the arrangement for private patients is that the actual vaccination is free of charge but you must pay for the GP's service
ga: I gcás cuid de na seirbhísí vacsaínithe, (mar shampla, vacsaín an fhliú do ghrúpaí atá i mbaol), is é an socrú atá ann i measc othair phríobháideacha go bhfuil an vacsaíniú féin saor in aisce, ach is gá duit íoc as seirbhís an LG
